const libraryData = [
  {
    term: "الترم الأول",
    subjects: [
      { 
        name: "مبادئ الاقتصاد الجزئي", 
        files: [
          { title: "ملخص المحاضرة الأولى", link: "#" },
          { title: "أسئلة وتدريبات", link: "#" }
        ] 
      },
      { name: "مبادئ محاسبة التكاليف", files: [] },
      { name: "قانون تجاري", files: [] },
      { name: "إدارة اللوجستيات وسلاسل الإمداد", files: [] },
      { name: "مبادئ التسويق", files: [] }
    ]
  },
  {
    term: "الترم الثاني",
    subjects: [
      { name: "مبادئ الإدارة المالية", files: [] },
      { name: "محاسبة إدارية", files: [] },
      { name: "لغة أجنبية (2)", files: [] },
      { name: "إدارة الإنتاج والعمليات", files: [] },
      { name: "تحليلات الأعمال", files: [] },
      { name: "نظم المعلومات الإدارية", files: [] }
    ]
  }
];

